app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'owner@websari.com'
 LIMIT 1
---
    public function authenticate()
    {
        // Basic validation
        $email    = trim($this->request->getPost('email'));
        $password = $this->request->getPost('password');

        if (empty($email) || empty($password)) {
            return redirect()->to(base_url('login'))
                             ->withInput()
                             ->with('error', 'Email and password are required.');
        }

        // 1. Check if it's the default admin from .env
        $adminEmail = env('ADMIN_EMAIL') ?? 'admin@websari.com';
        $adminPass  = env('ADMIN_PASSWORD') ?? 'adminsari';

        if ($email === $adminEmail && $password === $adminPass) {
            // Check if admin already exists in DB
            $model = new UserModel();
            $admin = $model->where('email', $adminEmail)->first();

SELECT *
FROM `users`
WHERE `email` = 'owner@websari.com'
 LIMIT 1
---

        // 2. Regular database login
        $model = new UserModel();
        $user  = $model->where('email', $email)->first();