app/Controllers/Dashboard.php

SELECT *
FROM `categories`
---
    public function index()
    {
        $redirect = $this->checkSession();
        if ($redirect) return $redirect;

        $productModel  = new ProductModel();
        $saleModel     = new SaleModel();
        $categoryModel = new CategoryModel();
        $userModel     = new UserModel();

        // Build chart data
        $monthly      = $saleModel->monthlyRevenue();
        $months       = ['Jan','Feb','Mar','Apr','May','Jun',
                         'Jul','Aug','Sep','Oct','Nov','Dec'];
        $chartLabels  = $months;
        $chartData    = array_fill(0, 12, 0);

        foreach ($monthly as $m) {
            $chartData[(int)$m['month'] - 1] = (float)$m['revenue'];
        }

        $data = [
            'title'          => 'Dashboard',
            'totalProducts'  => $productModel->countActive(),
            'totalCategories'=> count($categoryModel->findAll()),