app/Controllers/Products.php

SELECT *
FROM `categories`
---
    public function index()
    {
        $redirect = $this->checkSession();
        if ($redirect) return $redirect;

        $data = [
            'title'      => 'Products',
            'products'   => $this->productModel->getAllWithCategory(),
            'categories' => $this->categoryModel->findAll(),
        ];

SELECT *
FROM `products`
WHERE `products`.`id` = 4
SELECT *
FROM `categories`
---
    public function edit(int $id)
    {
        $redirect = $this->checkOwner();
        if ($redirect) return $redirect;

        $product = $this->productModel->find($id);
        if (!$product) {
            return redirect()->to('/products')
                             ->with('error', 'Product not found.');
        }

        $data = [
            'title'      => 'Edit Product',
            'product'    => $product,
            'categories' => $this->categoryModel->findAll(),
        ];