app/Controllers/Reports.php

SELECT `sales`.*, `users`.`name` as `cashier_name`
FROM `sales`
LEFT JOIN `users` ON `users`.`id` = `sales`.`user_id`
WHERE DATE(sales.created_at) >= '2026-05-01'
AND DATE(sales.created_at) <= '2026-05-14'
ORDER BY `sales`.`created_at` DESC
---
    public function sales()
    {
        $redirect = $this->checkOwner();
        if ($redirect) return $redirect;

        $saleModel = new SaleModel();
        $from = $this->request->getGet('from') ?? date('Y-m-01');
        $to   = $this->request->getGet('to')   ?? date('Y-m-d');

        $sales = $saleModel->select('sales.*, users.name as cashier_name')
                           ->join('users', 'users.id = sales.user_id', 'left')
                           ->where('DATE(sales.created_at) >=', $from)
                           ->where('DATE(sales.created_at) <=', $to)
                           ->orderBy('sales.created_at', 'DESC')
                           ->findAll();