app/Controllers/Sales.php

SELECT *
FROM `products`
WHERE `products`.`id` = 12
---
                continue;
            }

            $product = $this->productModel->find($item['product_id']);

INSERT INTO `sales` (`invoice_no`, `user_id`, `customer_name`, `subtotal`, `discount`, `total`, `amount_paid`, `change_amount`, `payment_method`, `status`, `notes`, `created_at`, `updated_at`) VALUES ('WS-20260507-0020', '8', 'Walk-in Customer', 1440, 0, 1440, 2000, 560, 'cash', 'completed', '', '2026-05-07 07:46:17', '2026-05-07 07:46:17')
---

        try {
            // Insert sale record
            $saleId = $this->saleModel->insert([
                'invoice_no'     => $this->saleModel->generateInvoice(),
                'user_id'        => $this->session->get('user_id'),
                'customer_name'  => $customerName,
                'subtotal'       => $subtotal,
                'discount'       => $discount,
                'total'          => $total,
                'amount_paid'    => $amountPaid,
                'change_amount'  => $changeAmount,
                'payment_method' => $paymentMethod,
                'status'         => $status,
                'notes'          => $notes,
            ]);

INSERT INTO `sale_items` (`sale_id`, `product_id`, `quantity`, `price`, `subtotal`) VALUES (31, 12, 9, 160, 1440)
---
                // ✅ Support both 'qty' and 'quantity' keys
                $qty = isset($item['qty']) ? intval($item['qty']) : intval($item['quantity'] ?? 0);

                $this->saleItemModel->insert([
                    'sale_id'    => $saleId,
                    'product_id' => intval($item['product_id']),
                    'quantity'   => $qty,
                    'price'      => floatval($item['price']),
                    'subtotal'   => floatval($item['subtotal']),
                ]);