app/Controllers/Utang.php

SELECT *
FROM `sales`
WHERE `sales`.`id` = 22
UPDATE `sales` SET `status` = 'completed', `amount_paid` = '54.00', `updated_at` = '2026-05-07 04:46:42'
WHERE `id` = 22
---
    public function markPaid(int $id)
    {
        $redirect = $this->checkOwner();
        if ($redirect) return $redirect;

        $sale = $this->saleModel->find($id);

        if (!$sale) {
            return redirect()->to(base_url('utang'))
                             ->with('error', 'Sale not found.');
        }

        // Deduct stock
        $items = $this->saleItemModel->getBySale($id);
        foreach ($items as $item) {
            $this->productModel->deductStock(
                $item['product_id'],
                $item['quantity']
            );
        }

        $this->saleModel->where('id', $id)->set([
            'status'      => 'completed',
            'amount_paid' => $sale['total'],
        ])->update();