app/Models/ProductModel.php

SELECT `products`.*, `categories`.`name` as `category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`status` = 'active'
ORDER BY `products`.`name` ASC
---
    public function getAllWithCategory()
    {
        return $this->select('products.*, categories.name as category_name')
                    ->join('categories',
                           'categories.id = products.category_id', 'left')
                    ->where('products.status', 'active')
                    ->orderBy('products.name', 'ASC')
                    ->findAll();

SELECT `products`.*, `categories`.`name` as `category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`status` = 'active'
AND products.stock <= products.low_stock_alert
ORDER BY `products`.`stock` ASC
---
    public function getLowStock()
    {
        return $this->select('products.*, categories.name as category_name')
                    ->join('categories',
                           'categories.id = products.category_id', 'left')
                    ->where('products.status', 'active')
                    ->where('products.stock <= products.low_stock_alert', null, false)
                    ->orderBy('products.stock', 'ASC')
                    ->findAll();

SELECT *
FROM `products`
WHERE `products`.`id` = 12
UPDATE `products` SET `stock` = 0, `updated_at` = '2026-05-07 07:46:17'
WHERE `products`.`id` IN (12)
---
    public function deductStock(int $productId, int $qty)
    {
        $product = $this->find($productId);
        if ($product) {
            $newStock = max(0, $product['stock'] - $qty);
            return $this->update($productId, ['stock' => $newStock]);

SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `status` = 'active'
---
    public function countActive()
    {
        return $this->where('status', 'active')->countAllResults();