app/Models/SaleItemModel.php

    public function getBySale(int $saleId)
    {
        return $this->select('sale_items.*,
                              products.name as product_name,
                              products.unit,
                              products.barcode')
                    ->join('products',
                           'products.id = sale_items.product_id', 'left')
                    ->where('sale_items.sale_id', $saleId)
                    ->findAll();
---
SELECT `sale_items`.*, `products`.`name` as `product_name`, `products`.`unit`, `products`.`barcode`
FROM `sale_items`
LEFT JOIN `products` ON `products`.`id` = `sale_items`.`product_id`
WHERE `sale_items`.`sale_id` = 22