app/Models/SaleModel.php

    public function generateInvoice()
    {
        $prefix = 'WS-' . date('Ymd') . '-';
        $last   = $this->like('invoice_no', $prefix)
                       ->orderBy('id', 'DESC')
                       ->first();
---
SELECT *
FROM `sales`
WHERE `invoice_no` LIKE '%WS-20260507-%' ESCAPE '!'
ORDER BY `id` DESC
 LIMIT 1

    public function getAllWithCashier()
    {
        return $this->select('sales.*, users.name as cashier_name')
                    ->join('users', 'users.id = sales.user_id', 'left')
                    ->orderBy('sales.created_at', 'DESC')
                    ->findAll();
---
SELECT `sales`.*, `users`.`name` as `cashier_name`
FROM `sales`
LEFT JOIN `users` ON `users`.`id` = `sales`.`user_id`
ORDER BY `sales`.`created_at` DESC

    public function getWithDetails(int $id)
    {
        $sale = $this->select('sales.*, users.name as cashier_name')
                     ->join('users', 'users.id = sales.user_id', 'left')
                     ->find($id);
---
SELECT `sales`.*, `users`.`name` as `cashier_name`
FROM `sales`
LEFT JOIN `users` ON `users`.`id` = `sales`.`user_id`
WHERE `sales`.`id` = 8

    public function todaySales()
    {
        return $this->where('DATE(created_at)', date('Y-m-d'))
                    ->where('status', 'completed')
                    ->findAll();
---
SELECT *
FROM `sales`
WHERE DATE(created_at) = '2026-05-07'
AND `status` = 'completed'

    public function todayRevenue()
    {
        $r = $this->selectSum('total', 'revenue')
                  ->where('DATE(created_at)', date('Y-m-d'))
                  ->where('status', 'completed')
                  ->first();
---
SELECT SUM(`total`) AS `revenue`
FROM `sales`
WHERE DATE(created_at) = '2026-05-07'
AND `status` = 'completed'
 LIMIT 1

    public function monthlyRevenue()
    {
        return $this->select('MONTH(created_at) as month, SUM(total) as revenue')
                    ->where('YEAR(created_at)',  date('Y'))
                    ->where('status', 'completed')
                    ->groupBy('MONTH(created_at)')
                    ->orderBy('month', 'ASC')
                    ->findAll();
---
SELECT MONTH(created_at) as month, SUM(total) as revenue
FROM `sales`
WHERE YEAR(created_at) = '2026'
AND `status` = 'completed'
GROUP BY MONTH(created_at)
ORDER BY `month` ASC