app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `status` = 'active'
---
    public function getActiveUsers()
    {
        return $this->where('status', 'active')->findAll();