app/Models/UtangModel.php

    public function getBySale(int $saleId)
    {
        return $this->select('utang_payments.*, users.name as recorder_name')
                    ->join('users',
                           'users.id = utang_payments.recorded_by', 'left')
                    ->where('utang_payments.sale_id', $saleId)
                    ->orderBy('utang_payments.created_at', 'ASC')
                    ->findAll();
---
SELECT `utang_payments`.*, `users`.`name` as `recorder_name`
FROM `utang_payments`
LEFT JOIN `users` ON `users`.`id` = `utang_payments`.`recorded_by`
WHERE `utang_payments`.`sale_id` = 8
ORDER BY `utang_payments`.`created_at` ASC